#include <iostream>

#include "json_reader.h"

int main() {
    /*
     * Примерная структура программы:
     *
     * Считать JSON из stdin
     * Построить на его основе JSON базу данных транспортного справочника
     * Выполнить запросы к справочнику, находящиеся в массиве "stat_requests", построив JSON-массив
     * с ответами.
     * Вывести в stdout ответы в виде JSON
     */
    std::ostringstream output;
    json_reader::JsonReader processing(output);
    processing.Reader();
    std::cout << processing.Result().str();
}